{
  "experiences": [
    {
      "company": "DevOps Engineering",
      "logo": "devops_engineering_logo.png",
      "title": "DevOps Engineer",
      "employmentType": "Contract",
      "startDate": "2017",
      "endDate": "Present",
      "duration": "7 yrs 10 mos",
      "location": "London Area, United Kingdom · Remote",
      "description": "🚀 Continuous Delivery (CD) is a game-changing strategy in software development, empowering organizations to deliver new features to users as swiftly and efficiently as possible. 🌍 The core concept of CD lies in creating a repeatable, reliable, and increasingly optimized process for moving software from concept to customer. This results in faster and more frequent releases, giving businesses a crucial edge in today's competitive landscape. 💼\n\nAt the heart of CD is the pipeline—a set of automated steps designed to build, test, and deploy software. 🛠️ By automating these processes, companies can not only reduce the time to market for new features but also improve quality and reliability. 📈 In the era of digital transformation and AI-driven development, this ability to consistently and quickly deliver is paramount. ⚡\n\nIn a fast-paced business environment, agility is essential. CD offers a streamlined framework to accelerate feature releases and respond to market demands. Automation is key here, allowing teams to focus on innovation while reducing manual efforts in deployment.\n\n🔑 Key Takeaway: Continuous Delivery allows organizations to maintain a constant flow of changes into production. It's all about speed, efficiency, and delivering value to customers faster, powered by a well-oiled, automated pipeline. 🔄\n\nLooking for global contracting opportunities to bring this expertise to businesses everywhere. 🌐 #SoftwareDevelopment #CD #Automation #DevOps #DigitalTransformation #AI #CloudComputing",
      "skills": [
        "Terraform",
        "Automation",
        "Nginx",
        "Python (Programming Language)",
        "Iac",
        "DevOps",
        "Site Reliability Engineering"
      ]
    },
    {
      "company": "ChatGPT Prompt Engineering",
      "logo": "chatgpt_prompt_engineering_logo.png",
      "title": "ChatGPT Prompt Engineering Trainer",
      "employmentType": "Contract",
      "startDate": "May 2024",
      "endDate": "Jun 2024",
      "duration": "2 mos",
      "location": "Cambridge, England, United Kingdom · Remote",
      "description": "**ChatGPT Prompt Engineering Trainer** \n*Contract: January 2024 – May 2024*\n\n**Description:**\n\nAs a ChatGPT Prompt Engineering Trainer, I develop and deliver specialized training programs designed to enhance participants' skills in creating effective prompts for ChatGPT. The primary objective is to empower users to improve the quality, accuracy, and relevance of ChatGPT's responses for both personal and professional use.\n\n**Key Responsibilities:**\n\n- **Program Design**: Created a structured 4-hour training, divided into four 1-hour modules, each focusing on key elements of prompt engineering.\n- **Training Delivery**: Conducted interactive sessions incorporating presentations, discussions, and practical exercises to ensure participants grasp and apply prompt engineering techniques.\n- **Participant Engagement**: Led Q&A sessions and offered individualized feedback, helping participants fine-tune their skills.\n- **Material Development**: Developed detailed training materials, including presentation decks, handouts, and prompt examples for analysis and enhancement.\n\n**Training Modules:**\n\n1. **Introduction to ChatGPT and Prompt Engineering** \n - Overview of ChatGPT's capabilities and limitations \n - The importance of prompt engineering \n - Examples illustrating effective vs. ineffective prompts \n\n2. **Crafting Effective Prompts** \n - Techniques for writing clear and precise prompts \n - Strategies to elicit specific types of responses \n\n3. **Advanced Prompt Techniques** \n - Leveraging context and specificity in prompts \n - Managing complex queries and multi-part prompts \n\n4. **Practical Application and Feedback** \n - Hands-on exercises and real-world scenarios \n - Personalized feedback and strategies for improvement \n\nThis training is suited for writers, educators, developers, business professionals, and anyone seeking to harness the full potential of ChatGPT in their work.",
      "skills": [
        "Prompt Engineering",
        "Training Delivery",
        "ChatGPT",
        "Machine Learning",
        "GPT-4",
        "Employee Training"
      ]
    },
    {
      "company": "DevOps Lead Goldman Sachs | Everstone Company",
      "logo": "goldman_sachs_logo.png",
      "title": "DevOps Lead",
      "employmentType": "Contract",
      "startDate": "Aug 2023",
      "endDate": "Dec 2023",
      "duration": "5 mos",
      "location": "Muscat, Masqaţ, Oman · Hybrid",
      "description": "Designing and implementing a CI/CD system with AI integration for a leading telecom provider involves several key steps and requirements. The project will focus on integrating all data sources and using AI to improve the efficiency and accuracy of the DevOps processes. This will enable faster and more reliable software releases. The solution aims to transform the telecom provider's operations, ensuring they remain competitive. Cprime's expertise in digital transformation and technology solutions, backed by over 20 years of experience, positions it well to meet these challenges. The project will be undertaken in key locations including Oman, Abu Dhabi, Dubai, and Jeddah, leveraging Cprime's global consulting capabilities to deliver a cutting-edge system tailored to the needs of the telecommunications sector.This was a collaboration with Alten and ACL Digital With Cprime.",
      "skills": [
        "Software Development Life Cycle (SDLC)",
        "DevOps"
      ]
    },
    {
      "company": "Site reliability Engineer - GWLE - Canadalife - Sword 🇨🇦",
      "logo": "canadalife_logo.png",
      "title": "Site reliability Engineer",
      "employmentType": "Contract",
      "startDate": "Nov 2020",
      "endDate": "Feb 2021",
      "duration": "4 mos",
      "location": "United Kingdom · Hybrid",
      "description": "As a DevOps Engineer, I managed and developed continuous integration and deployment solutions for production applications across various sites and software. I created new technology infrastructures and maintained configuration management and automation tools. I oversaw code releases, developed automation tools to deploy software to various platforms, and maintained services. Additionally, I collaborated with other engineers to understand the impacts of branches and code merges.\n\nMy responsibilities included managing tools and testing environments, central code control, adherence to development and code security standards, and writing software that automates software builds, application deployment processes, and infrastructure integration. I ensured that the DevOps strategy is implemented in the end-to-end development of software products.\n\nI have technical competence equivalent to that of a Lead Developer. I designed, built, and optimized comprehensive automation systems, and created and enforced best practices. I monitored build and release procedures, dependencies, and notification lists. I identified and resolved delivery issues and integrated new or updated features into existing project stacks and frameworks.\n\nIn summary, as a DevOps Engineer, I implemented software engineering principles and practices to infrastructure and operations problems, to create scalable and highly reliable software systems.",
      "skills": [
        "Back-End Web Development",
        "Continuous Integration",
        "Enterprise Software",
        "DevOps",
        "Cloud Computing"
      ]
    },
    {
      "company": "DevSecOps SRE Consultant ( WorldCup ) 🇶🇦",
      "logo": "worldcup_logo.png",
      "title": "DevSecOps SRE Consultant",
      "employmentType": "Contract",
      "startDate": "Aug 2020",
      "endDate": "Dec 2020",
      "duration": "5 mos",
      "location": "Cambridge, England, United Kingdom · Hybrid",
      "description": "As an experienced Azure DevSecOps consultant, I have a deep understanding of the complex technological needs of enterprises. My focus is on providing comprehensive solutions that enable enterprises to remain agile, secure, and competitive in today's fast-paced business environment.\n\nIn order to achieve this, I have honed my skills and expertise to specialize in a wide range of technological capabilities, making me uniquely qualified to address any challenges that may arise. These capabilities include version control, reporting, requirements management, project management, automated builds, testing, and release management. By leveraging my extensive knowledge in these areas, I am able to provide my clients with the most effective and efficient solutions for their unique needs.\n\nBut my dedication to my clients doesn't stop there. I understand that every enterprise is unique, and I prioritize building strong relationships with each of my clients. By taking the time to listen to your needs, understand your objectives, and provide tailored solutions that best fit your enterprise, I am able to ensure that you receive the highest level of service and support. And because I stay up-to-date with the latest technological advancements, I am always able to provide you with the most innovative solutions that meet your specific needs.",
      "skills": [
        "Management",
        "Software Project Management",
        "Java",
        "Windows Azure",
        "Microsoft Azure"
      ]
    }
  ]
}
